app/User.php

    public function hasPermission($section_name)
    {
        if (self::isAdmin()) {
            if (!isset($this->permissions)) {
                $sections_id = Permission::where('role_id', '=', $this->role_id)->where('allow', true)->pluck('section_id')->toArray();
---
select `section_id` from `permissions` where `role_id` = 2 and `allow` = 1

    public function getUnReadNotifications()
    {
        $notifications = Notification::where(function ($query) {
            $query->where(function ($query) {
                $query->where('user_id', $this->id)
                    ->where('type', 'single');
            })->orWhere(function ($query) {
                if (!$this->isAdmin()) {
                    $query->whereNull('user_id')
                        ->whereNull('group_id')
                        ->where('type', 'all_users');
                }
            });
        })->doesntHave('notificationStatus')
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `notifications` where ((`user_id` = 1 and `type` = 'single')) and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc