app/Http/Controllers/Web/HomeController.php

    public function index()
    {
        $homeSectionsSettings = getHomeSectionsSettings();

        $featureWebinars = FeatureWebinar::whereIn('page', ['home', 'home_categories'])
            ->where('status', 'publish')
            ->whereHas('webinar', function ($query) {
                $query->where('status', Webinar::$active);
            })
            ->with([
                'webinar' => function ($query) {
                    $query->with([
                        'teacher' => function ($qu) {
                            $qu->select('id', 'full_name', 'avatar');
                        },
                        'reviews' => function ($query) {
                            $query->where('status', 'active');
                        },
                        'tickets',
                        'feature'
                    ]);
                }
            ])
            ->orderBy('updated_at', 'desc')
            ->get();
        //$selectedWebinarIds = $featureWebinars->pluck('id')->toArray();

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['latest_classes']) and $homeSectionsSettings['latest_classes']) {
            $latestWebinars = Webinar::where('status', Webinar::$active)
                ->where('private', false)
                ->orderBy('updated_at', 'desc')
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'tickets',
                    'feature'
                ])
                ->limit(6)
                ->get();
---
select * from `feature_webinars` where `page` in ('home', 'home_categories') and `status` = 'publish' and exists (select * from `webinars` where `feature_webinars`.`webinar_id` = `webinars`.`id` and `status` = 'active') order by `updated_at` desc
select * from `tickets` where `tickets`.`webinar_id` in (2001, 2003)

        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['best_sellers']) and $homeSectionsSettings['best_sellers']) {
            $bestSaleWebinarsIds = Sale::whereNotNull('webinar_id')
                ->select(DB::raw('COUNT(id) as cnt,webinar_id'))
                ->groupBy('webinar_id')
                ->orderBy('cnt', 'DESC')
                ->limit(6)
                ->pluck('webinar_id')
                ->toArray();

            $bestSaleWebinars = Webinar::whereIn('id', $bestSaleWebinarsIds)
                ->where('status', Webinar::$active)
                ->where('private', false)
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'sales',
                    'tickets',
                    'feature'
                ])
                ->get();
---
select COUNT(id) as cnt,webinar_id from `sales` where `webinar_id` is not null group by `webinar_id` order by `cnt` desc limit 6
select * from `webinars` where `id` in (1996, 2009, 1995, 1998, 2000, 2008) and `status` = 'active' and `private` = 0

        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['best_rates']) and $homeSectionsSettings['best_rates']) {
            $bestRateWebinars = Webinar::join('webinar_reviews', 'webinars.id', '=', 'webinar_reviews.webinar_id')
                ->select('webinars.*', 'webinar_reviews.rates', 'webinar_reviews.status', DB::raw('avg(rates) as avg_rates'))
                ->where('webinars.status', 'active')
                ->where('webinars.private', false)
                ->where('webinar_reviews.status', 'active')
                ->groupBy('teacher_id')
                ->orderBy('avg_rates', 'desc')
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    }
                ])
                ->limit(6)
                ->get();
---
select `webinars`.*, `webinar_reviews`.`rates`, `webinar_reviews`.`status`, avg(rates) as avg_rates from `webinars` inner join `webinar_reviews` on `webinars`.`id` = `webinar_reviews`.`webinar_id` where `webinars`.`status` = 'active' and `webinars`.`private` = 0 and `webinar_reviews`.`status` = 'active' group by `teacher_id` order by `avg_rates` desc limit 6

            $now = time();
            $webinarIdsHasDiscount = [];

            $tickets = Ticket::where('start_date', '<', $now)
                ->where('end_date', '>', $now)
                ->get();
---
select * from `tickets` where `start_date` < 1669023056 and `end_date` > 1669023056

                }
            }

            $specialOffersWebinarIds = SpecialOffer::where('status', 'active')
                ->where('from_date', '<', $now)
                ->where('to_date', '>', $now)
                ->pluck('webinar_id')
                ->toArray();

            $webinarIdsHasDiscount = array_merge($specialOffersWebinarIds, $webinarIdsHasDiscount);

            $hasDiscountWebinars = Webinar::whereIn('id', array_unique($webinarIdsHasDiscount))
                ->where('status', Webinar::$active)
                ->where('private', false)
                ->with([
                    'teacher' => function ($qu) {
                        $qu->select('id', 'full_name', 'avatar');
                    },
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'sales',
                    'tickets',
                    'feature'
                ])
                ->limit(6)
                ->get();
---
select `webinar_id` from `special_offers` where `status` = 'active' and `from_date` < 1669023056 and `to_date` > 1669023056
select * from `tickets` where `tickets`.`webinar_id` in (2001, 2003)
select * from `webinars` where `id` in (2001, 2003) and `status` = 'active' and `private` = 0 limit 6

        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['trend_categories']) and $homeSectionsSettings['trend_categories']) {
            $trendCategories = TrendCategory::with([
                'category' => function ($query) {
                    $query->withCount([
                        'webinars' => function ($query) {
                            $query->where('status', 'active');
                        }
                    ]);
                }
            ])->orderBy('created_at', 'desc')
                ->limit(6)
                ->get();
        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['blog']) and $homeSectionsSettings['blog']) {
            $blog = Blog::where('status', 'publish')
                ->with(['category', 'author' => function ($query) {
                    $query->select('id', 'full_name');
                }])->orderBy('updated_at', 'desc')
                ->withCount('comments')
                ->orderBy('created_at', 'desc')
                ->limit(3)
                ->get();
        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['instructors']) and $homeSectionsSettings['instructors']) {
            $instructors = User::where('role_name', Role::$teacher)
                ->select('id', 'full_name', 'avatar', 'bio')
                ->where('status', 'active')
                ->where(function ($query) {
                    $query->where('ban', false)
                        ->orWhere(function ($query) {
                            $query->whereNotNull('ban_end_at')
                                ->where('ban_end_at', '<', time());
                        });
                })
                ->limit(8)
                ->get();
        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['organizations']) and $homeSectionsSettings['organizations']) {
            $organizations = User::where('role_name', Role::$organization)
                ->where('status', 'active')
                ->where(function ($query) {
                    $query->where('ban', false)
                        ->orWhere(function ($query) {
                            $query->whereNotNull('ban_end_at')
                                ->where('ban_end_at', '<', time());
                        });
                })
                ->withCount('webinars')
                ->orderBy('webinars_count', 'desc')
                ->limit(6)
                ->get();
        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['testimonials']) and $homeSectionsSettings['testimonials']) {
            $testimonials = Testimonial::where('status', 'active')->get();
        }

        if (!empty($homeSectionsSettings) and !empty($homeSectionsSettings['subscribes']) and $homeSectionsSettings['subscribes']) {
            $subscribes = Subscribe::all();
---
select * from `trend_categories` order by `created_at` desc limit 6
select * from `blog_categories` where `blog_categories`.`id` in (34, 36, 37)
select `id`, `full_name`, `avatar`, `bio` from `users` where `role_name` = 'teacher' and `status` = 'active' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1669023056)) limit 8
select `users`.*, (select count(*) from `webinars` where `users`.`id` = `webinars`.`creator_id` or `teacher_id` is null) as `webinars_count` from `users` where `role_name` = 'organization' and `status` = 'active' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1669023056)) order by `webinars_count` desc limit 6
select * from `testimonials` where `status` = 'active'
select * from `subscribes`

            $becomeInstructorSection = getBecomeInstructorSectionSettings();
        }

        $advertisingBanners = AdvertisingBanner::where('published', true)
            ->whereIn('position', ['home1', 'home2'])
            ->get();

        $skillfulTeachersCount = User::where('role_name', Role::$teacher)
            ->where(function ($query) {
                $query->where('ban', false)
                    ->orWhere(function ($query) {
                        $query->whereNotNull('ban_end_at')
                            ->where('ban_end_at', '<', time());
                    });
            })
            ->where('status', 'active')
            ->count();

        $studentsCount = User::where('role_name', Role::$user)
            ->where(function ($query) {
                $query->where('ban', false)
                    ->orWhere(function ($query) {
                        $query->whereNotNull('ban_end_at')
                            ->where('ban_end_at', '<', time());
                    });
            })
            ->where('status', 'active')
            ->count();

        $liveClassCount = Webinar::where('type', 'webinar')
            ->where('status', 'active')
            ->count();

        $offlineCourseCount = Webinar::where('status', 'active')
            ->whereIn('type', ['course', 'text_lesson'])
            ->count();
---
select * from `advertising_banners` where `published` = 1 and `position` in ('home1', 'home2')
select count(*) as aggregate from `users` where `role_name` = 'teacher' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1669023056)) and `status` = 'active'
select count(*) as aggregate from `users` where `role_name` = 'user' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1669023056)) and `status` = 'active'
select count(*) as aggregate from `webinars` where `type` = 'webinar' and `status` = 'active'
select count(*) as aggregate from `webinars` where `status` = 'active' and `type` in ('course', 'text_lesson')