app/Models/Category.php

select * from `categories` where `categories`.`parent_id` in (520, 522, 523, 524, 525, 526, 528) order by `order` asc, `order` asc
---
    static function getCategories()
    {
        $categories = cache()->remember(self::$cacheKey, 24 * 60 * 60, function () {
            return self::whereNull('parent_id')
                ->with([
                    'subCategories' => function ($query) {
                        $query->orderBy('order', 'asc');
                    },
                ])
                ->get();