app/Http/Controllers/Admin/WebinarController.php

select count(*) as aggregate from `webinars` where `webinars`.`type` = 'webinar'
select count(*) as aggregate from `webinars` where `webinars`.`type` = 'webinar' and `webinars`.`status` = 'pending'
select sum(`duration`) as aggregate from `webinars` where `webinars`.`type` = 'webinar'
select count(sales.webinar_id) as sales_count from `webinars` inner join `sales` on `webinars`.`id` = `sales`.`webinar_id` where `webinars`.`type` = 'webinar' and `sales`.`webinar_id` is not null and `sales`.`refund_at` is null limit 1
select * from `categories` where `parent_id` is null
select * from `filters` where `filters`.`category_id` in (520, 522, 523, 524, 525, 526, 528)
---
    public function index(Request $request)
    {
        $this->authorize('admin_webinars_list');

        removeContentLocale();

        $type = $request->get('type', 'webinar');
        $query = Webinar::where('webinars.type', $type);

        $totalWebinars = $query->count();
        $totalPendingWebinars = deepClone($query)->where('webinars.status', 'pending')->count();
        $totalDurations = deepClone($query)->sum('duration');
        $totalSales = deepClone($query)->join('sales', 'webinars.id', '=', 'sales.webinar_id')
            ->select(DB::raw('count(sales.webinar_id) as sales_count'))
            ->whereNotNull('sales.webinar_id')
            ->whereNull('sales.refund_at')
            ->first();

        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->with('filters')
            ->get();

select * from `filters` where `category_id` = 520
---
            }
        }

        $level = Filter::where('category_id', $categories[0]->id)->with('options')->get();

select * from `users` where `users`.`id` in (859, 929, 930, 979, 995, 996, 1016, 1017, 1031)
select * from `sales` where `ticket_id` is null order by `id` desc limit 10 offset 0
select * from `webinars` where `webinars`.`id` in (2008, 2009, 2012)
select count(*) as aggregate from `sales` where `ticket_id` is null
---
    public function student(Request $request)
    {
        $student_id = $request->get('student_id');
        $course_id = $request->get('course_id');
        $full_name = $request->get('full_name');

        $sale = Sale::where('ticket_id', null)->with('webinar', 'buyer')->orderBy('id', 'desc');

        // $webinar = Webinar::where('status', 'active')->orderBy('id', 'desc');
        if (!empty($student_id)) {
            $sale->where('buyer_id', $student_id);
        }
        if (!empty($course_id)) {
            $sale->where('webinar_id', $course_id);
        }
        if (!empty($full_name)) {
            $user = User::where('full_name', 'Like', "%$full_name%")->first();
            // dd($user);
            $sale->where('buyer_id', $user ? $user->id : null);
        }

        $query =  $sale->paginate(10);